app/controllers/groups_controller.rb

INSERT INTO `groups` (`group_name`, `group_description`, `responsable_name`, `group_phone`, `state`, `created_at`, `updated_at`) VALUES ('acme', '1', 'andrey', 3184148797, 'received', '2015-09-06 21:56:40', '2015-09-06 21:56:40')
---
  def create_group
    @group = Group.new(permited_params_create_group)
    flag=@group.save

SELECT COUNT(*) FROM `addresses` WHERE (addresses.latitude BETWEEN -19.94133821605919 AND -19.923351783940813 AND addresses.longitude BETWEEN -43.96456127593828 AND -43.94542872406171 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((-19.932345 - addresses.latitude) * PI() / 180 / 2), 2) + COS(-19.932345 * PI() / 180) * COS(addresses.latitude * PI() / 180) * POWER(SIN((-43.954995 - addresses.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 1)
SELECT addresses.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((-19.941485 - addresses.latitude) * PI() / 180 / 2), 2) + COS(-19.941485 * PI() / 180) * COS(addresses.latitude * PI() / 180) * POWER(SIN((-43.933494 - addresses.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( SIN( (addresses.longitude - -43.933494) / 57.2957795 ) * COS( (addresses.latitude) / 57.2957795 ), (COS( (-19.941485) / 57.2957795 ) * SIN( (addresses.latitude) / 57.2957795)) - (SIN( (-19.941485) / 57.2957795) * COS((addresses.latitude) / 57.2957795) * COS( (addresses.longitude - -43.933494) / 57.2957795))) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM `addresses` WHERE (addresses.latitude BETWEEN -19.986451080295936 AND -19.896518919704064 AND addresses.longitude BETWEEN -43.981328147430396 AND -43.88565985256961 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((-19.941485 - addresses.latitude) * PI() / 180 / 2), 2) + COS(-19.941485 * PI() / 180) * COS(addresses.latitude * PI() / 180) * POWER(SIN((-43.933494 - addresses.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 5)  ORDER BY distance ASC
---
  def near_groups
    user = User.new(permited_params_near_groups) #Used only for tests.
    nearby = Address.approved_group.near([user.latitude, user.longitude], 1, :units => :km)
    if !nearby.empty?